adscripciones/intercambiador_calor/foam/heatExchanger/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10800;
        startFace       718740;
    }
    inlet
    {
        type            patch;
        nFaces          4500;
        startFace       729540;
    }
    outlet
    {
        type            patch;
        nFaces          4500;
        startFace       734040;
    }
    blades
    {
        type            wall;
        inGroups        1(wall);
        nFaces          720;
        startFace       738540;
    }
)

// ************************************************************************* //
